<!DOCTYPE html>
<html>
  <head>
    <title>Setting up database</title>
  </head>
  <body>

    <h3>Setting up...</h3>

<?php // setup.php

  require_once 'mysql_login.php';
  require_once 'functions.php';

  echo "Droping existings tables... ";

  //http://www.sqlines.com/mysql/set_foreign_key_checks
  queryMysql("SET foreign_key_checks = 0");
  if ($tables = queryMysql("SHOW TABLES"))
  { 
    while ($row = $tables->fetch_array(MYSQLI_NUM))
    {
      queryMysql("DROP TABLE IF EXISTS ".$row[0]);
    }

  }

  echo "OK<br><br>";

   queryMysql("SET foreign_key_checks = 1");
  
  //Function for creating the tables 
  function createTable($name, $query)
  {
    echo "Creating table '$name' ... ";
    //a fuction included in functions.php
    queryMysql("CREATE TABLE IF NOT EXISTS $name($query)");
    echo "OK <br>";
  }

  createTable('members',
              'user VARCHAR(16),
               pass VARCHAR(16),
               INDEX(user(6))');

  echo "Inserting values into table ... ";
  queryMysql("INSERT INTO members VALUES('anagno', 'anagno')");
  queryMysql("INSERT INTO members VALUES('tme121', 'tme121')");
  echo "OK <br>";

  echo "<br>";

  createTable('posts',
              'ID int(11) NOT NULL AUTO_INCREMENT,
               title LONGTEXT,
               category VARCHAR(16),
               content LONGTEXT,
	       date DATETIME,
               primary key (id)');

  //categories: general, economy, science

  echo "Inserting values into table ... ";
  queryMysql("INSERT INTO posts (title,category,content,date) VALUES(
             'Ισραήλ, νομίζω ότι δεν θέλω να είσαι πια ο εκλεκτός λαός μου',        
             'general',
             'Πάνε πολλά χιλιάδες χρόνια από τότε που διάλεξα το έθνος του Ισραήλ ως τον εκλεκτό λαό μου. Λίγο το γεγονός ότι λυπήθηκα τα όσα τράβηξαν από τους Αιγύπτιους, λίγο το ότι βόλευε τις διηγήσεις και τις προφητείες που είχαν γίνει, με οδήγησαν στην απόφαση ο γιος μου, το καμάρι μου, να προέρχεται από το έθνος των ανθρώπων του Ισραήλ.

Δεν σας κρύβω πως έχω μετανιώσει για αυτή την απόφαση όσο λίγες στα άπειρα χρόνια στα οποία ζω. Μόνο την εξαφάνιση των δεινοσαύρων, τη σταύρωση του Χριστού (σόρρυ γιε μου, είχα πιει λιγάκι παραπάνω) και την παροχή δυνατότητας ομιλίας μόνο στους ανθρώπους μπορώ να συγκρίνω με την έμπνευσή μου να δώσω το χρίσμα του εκλεκτού λαού στο Ισραήλ. Το χειρότερο είναι πως όλα ξεκίνησαν καλά, αλλά κάπου στην πορεία, τα πάντα στράβωσαν. Δεν λέω, κι άλλοι έχουν σκοτώσει στο όνομα μου, αλλά ρε παιδιά εσείς το παρακάνετε. Αν είναι να σκοτώνετε παιδάκια για μια λωρίδα γης τότε να μεγαλώσω λιγάκι την περιοχή να τα βρείτε.

Ισραήλ σου έχω κάνει όλα τα χατίρια. Για όνομά μου, ακόμα και φέτος σήκωσε την Ευρωλίγκα η Μακάμπι με σέντερ τον Σχορτσιανίτη. Είχα να κάνω τέτοιο θαύμα από τη φλεγόμενη βάτο και αντί να αναλογιστείτε λίγο τι έγινε και να ηρεμήσετε, πάτε και σφάζετε τόσο κόσμο. Στάθηκα στοργικός πατέρας, έχω συγχωρήσει πολλά, αλλά φτάνει πια. Ισραήλ, συγχωρώ τα πάντα και αγαπώ τους πάντες, αλλά πρέπει να βρω άλλο εκλεκτό λαό, εκτίθεμαι με σένα.

Δεν είναι εύκολη η επιλογή, θα πρέπει να γίνει οικογενειακό συμβούλιο. Η άλλη θα φαγωθεί να κάνουμε εκλεκτό λαό τους Παοκτζήδες λόγω του Άγγελου αλλά δεν μπορώ να το δεχτώ. Προσωπικά σκέφτομαι το Βέλγιο, ήρεμοι τύποι, δεν νομίζω να αρχίσουν να σφάζουν και την πατήσω. Θα ενημερώσω για την απόφασή μου και σας υπόσχομαι πως θα προσπαθήσω να συμμαζέψω λίγο την κατάσταση, το πράγμα έχει ξεφύγει.',
           '2014-08-01')");

  queryMysql("INSERT INTO posts (title,category,content,date) VALUES(
             'Εγώ σας πάω, ελάτε όπως είστε',        
             'general',
             'Χαίρομαι ιδιαίτερα που το «Κουλούρι» μου δίνει την ευκαιρία να εκφράσω κι εγώ την άποψή μου σχετικά με τα όσα λέγονται και γράφονται τις τελευταίες ημέρες για εμένα την ίδια και τους αγαπημένους μου επισκέπτες. Ακούστηκαν πολλά και έχει γίνει μεγάλο σούσουρο. Νιώθω εκτεθειμένη και νομίζω ότι οφείλω μια απάντηση σε όσους με συκοφαντούν.

Σε αυτούς που λένε ότι «αυτό που συμβαίνει φέτος το καλοκαίρι στη Μύκονο είναι κατάντια και πλήρης ξεπεσμός ενός κοσμοπολίτικου νησιού» έχω να πω ότι αισθάνομαι ακόμη κοσμοπολίτισσα όσο ποτέ. Μπορεί οι μέρες που οι αγαπημένοι μου επισκέπτες έπιναν φλεγόμενα λαμποργκίνι να έχουν περάσει, αλλά τώρα, πιο ώριμη από ποτέ, νιώθω ότι μπορώ να αγκαλιάσω επισκέπτες από κάθε μεριά του κόσμου και από όλες τις κοινωνικές τάξεις.

Δηλαδή όσοι λένε όσα λένε νομίζουν ότι παλιά ήταν καλύτερα; Όσο παίζανε ξύλο οι Έλληνες με τους Ιταλούς στα στενάκια μου τα ξημερώματα ή όσο αυτός ο καραφλός κυκλοφορούσε όλη μέρα γυμνός και έκανε ελικοπτεράκια με τα γεννητικά του όργανα στο μαγιό-προβοσκίδα ελέφαντα, σας άρεσε ο κόσμος μου; Δεν παραπονιέμαι, εγώ όλους τους δέχομαι, απλά απορώ με τα όσα λέγονται τελευταία.

Να κλείσω με κάτι που με εκφράζει απόλυτα: Ελάτε όπως είστε, με το τζην, με το σκουλαρίκι. Ο μανάβης, η κομμώτρια, η νοσοκόμα και ο γκαραζιέρης να έρθουν στο νησί Ιούλιο μήνα και Αύγουστο αν θέλουν, μαζί με όλα τα χούγια τους. Εγώ ανήκω στο λαό μου.',
           '2014-07-24')");

  queryMysql("INSERT INTO posts (title,category,content,date) VALUES(
             'Βαριές κυρώσεις για όσους αφήνουν τα «ψωμάκια» από την πίτσα ορίζει η κυβέρνηση',        
             'economy',
             'Διχασμό στις τάξεις των απανταχού καλοφαγάδων έχει φέρει το νέο νομοσχέδιο που έχει τεθεί προς ψήφιση από την κυβέρνηση και βρίσκεται υπό συζήτηση τις τελευταίες ημέρες στο θερινό τμήμα της Βουλής.

Σύμφωνα με το νομοσχέδιο αυτό, το οποίο φέρει το κωδικό όνομα «Αχάριστος», θα προβλέπονται βαριά πρόστιμα σε όσους, αφού απολαύσουν το μέρος της πίτσας με τις γεύσεις που έχουν επιλέξει, αφήνουν την άκρη των κομματιών, που αποτελείται κυρίως από ζυμάρι, μέσα στο κουτί. Το φαινόμενο αυτό μάλιστα έχει την τάση να αυξάνεται με εκθετικούς ρυθμούς το τελευταίο διάστημα, προκαλώντας προβληματισμό στους ιδιοκτήτες ταχυφαγείων.

Όπως αναφέρει το επίμαχο νομοσχέδιο, οι ιδιοκτήτες των καταστημάτων έχουν το δικαίωμα, εφόσον παρατηρήσουν την παραπάνω συμπεριφορά, αρχικά να ζητήσουν από τους παραβάτες να ολοκληρώσουν το γεύμα τους και σε περίπτωση που αυτοί δεν συμμορφωθούν, μπορούν να τους επιβάλλουν πρόστιμο το οποίο θα φτάνει μερικές φορές ακόμα και στο δεκαπλάσιο του πλήθους των μη ολοκληρωμένων κομματιών πίτσας. Υπέρμαχος του νομοσχεδίου δήλωσε και ο Ευάγγελος Βενιζέλος ο οποίος τόνισε σχετικά: «Είναι απαράδεκτο στους καιρούς που διανύουμε να εγκαταλείπουμε το φαγητό μας. Είναι προκλητικό αλλά και αντιαισθητικό να αφήνουμε δαγκωμένο φαγητό μπροστά στον διπλανό μας, ο οποίος ενδεχομένως να ήθελε να το αξιοποιήσει καλύτερα». Στο πλευρό του προέδρου του ΠΑ.ΣΟ.Κ. τάχθηκε και η πλειοψηφία των βουλευτών, πλην εκείνων της Χρυσής Αυγής η οποία ανακοίνωσε λιτά πως «δεν ασχολούμαστε με ξενόφερτα φαγητά, ακόμα κι αν αυτά προέρχονται από την πατρίδα του Μπενίτο Μουσολίνι».

Όπως αναμενόταν ωστόσο, το νομοσχέδιο έχει διχάσει και την κοινή γνώμη. «Πολύ σωστό είναι το νομοσχέδιο και ακόμη πιο σωστό το όνομά του», τονίζει ο Βασίλης, 62χρονος αρτοποιός για να συνεχίσει λέγοντας πως «έχουμε ξεχάσει και υποτιμήσει πολύ το ψωμί. Είμαστε τελείως αχάριστοι. Το ψωμάκι δεν είναι απλά μέρος της πίτσας αλλά υπάρχει για να συμμετέχει γευστικά στο σύνολό της». Δεν είναι λίγοι ωστόσο και εκείνοι που διαφωνούν με το υπό συζήτηση νομοσχέδιο όπως η 25χρονη Πένυ, η οποία λίγο ως πολύ θεωρεί το ψωμάκι στην άκρη της πίτσας αναγκαίο κακό. «Δεν αμφιβάλλω ότι είναι χρήσιμο το ψωμάκι. Πώς αλλιώς θα κρατούσαμε το κομμάτι άλλωστε; Ωστόσο, δεν υπάρχει καμία λογική στο να το φάμε. Χαλάει όλη τη γεύση και επίσης σε εμποδίζει να φας περισσότερα κομμάτια», μας είπε η Πένυ η οποία τη στιγμή που έλεγε τα παραπάνω είχε ήδη δηλώσει χορτασμένη με τα δύο κομμάτια που έφαγε.

Σε κάθε περίπτωση η έκβαση του συγκεκριμένου ζητήματος αναμένεται με ιδιαίτερο ενδιαφέρον, ιδίως μετά τις τελευταίες εξελίξεις σύμφωνα με τις οποίες οι ιδιοκτήτες θα λαμβάνουν ποσοστό των προστίμων, κάτι που έχει οδηγήσει πολλούς εξ αυτών στην παραγωγή πίτσας με σημαντικά μεγαλύτερο ψωμάκι.',
           '2014-07-22')");

queryMysql("INSERT INTO posts (title,category,content,date) VALUES(
             'Πάνω από το 70% των επιφανειών στον Ηλεκτρικό είναι καλυμμένο με ιδρώτα, σύμφωνα με νέα έρευνα',        
             'science',
             'Ανησυχητικά είναι τα συμπεράσματα νέας έρευνας του πανεπιστημίου Πειραιά που έδειξε ότι πάνω από το 70% των συνολικών επιφανειών σε συρμούς, αποβάθρες και εκδοτήρια του Ηλεκτρικού της Αθήνας καλύπτονται από ιδρώτα, ο οποίος εκκρίνεται από τους επιβάτες κατά τις ώρες λειτουργίας του. Η κατάσταση φαίνεται ότι επιδεινώνεται κατά τους καλοκαιρινούς μήνες, ενώ οι επιστήμονες κρούουν τον κώδωνα του κινδύνου προειδοποιώντας ότι σε λίγο καιρό οι επιφάνειες των τρένων δεν θα μπορούν να χρησιμοποιούνται λόγω ολισθηρότητας.

Η έρευνα διήρκεσε έξι εβδομάδες και διενεργήθηκε από ειδική ομάδα ερευνητών του πανεπιστημίου, οι οποίοι εφοδιασμένοι με πειραματικούς σωλήνες, συλλέκτες υγρών και αντιολισθητικές σόλες παπουτσιών επισκέφθηκαν όλους ανεξαιρέτως τους σταθμούς και επιβιβάστηκαν σε πάνω από 100 δρομολόγια της γραμμής 1 του αττικού μετρό. Στην έκθεση αποτελεσμάτων τους, οι ειδικοί αναφέρουν πως «χαρακτηριστικό είναι ότι ο συσσωρευμένος ιδρώτας ανανεώνεται, καθώς υφίσταται εξάτμιση αλλά και απορροφάται από τις κάθε είδους επιφάνειες του συρμού, παρόλα αυτά η συγκέντρωσή του στον Ηλεκτρικό παρουσιάζει αυξητικές τάσεις» και συνεχίζουν σχολιάζοντας:

«Μάλιστα, φαίνεται πως έχει ξεπεραστεί το κρίσιμο σημείο καμπής της καμπύλης συγκέντρωσης-πυκνότητας, κάτι που σημαίνει ότι ακόμη κι αν διακοπεί τώρα η λειτουργία κάποιου συρμού και ως εκ τούτου ο ανεφοδιασμός του με τον ιδρώτα των επιβατών, οι επιφάνειές του δεν πρόκειται να στεγνώσουν για αρκετά μεγάλο διάστημα» τονίζουν.

Μεταξύ των άλλων, η επιστημονική ομάδα εφιστά την προσοχή της Πολιτείας επισημαίνοντας ότι το φαινόμενο ενδέχεται να έχει σύντομα δυσάρεστες επιπτώσεις προς τους πολίτες, οι οποίοι μπορεί να κινδυνεύσουν με πτώσεις λόγω του ολισθηρού πατώματος ή κάποιας υγρής χειρολαβής. Ακόμη, προειδοποιούν για φθορές στα χάρτινα εισιτήρια επιβίβασης στο τρένο, τα οποία από τη φύση τους παρουσιάζουν ευαισθησία στον ιδρώτα ενώ σημειώνουν ότι η δουλειά των υπαλλήλων στα εκδοτήρια, των οδηγών και των ελεγκτών ενδέχεται να αποκτήσει μια ιδιαιτέρως ανθυγιεινή διάσταση.

Μέχρι στιγμής δεν έχει υπάρξει επίσημη αντίδραση από την πλευρά του υπουργείου Μεταφορών,  όμως ήδη εκατοντάδες πολίτες σπεύδουν να υποστηρίξουν τα ευρήματα της έρευνας εξιστορώντας τις δικές τους εμπειρίες από τις μετακινήσεις τους με τον Ηλεκτρικό. Ενδεικτικά είναι τα παραδείγματα του 68χρονου Λυκούργου, ο οποίος πια φοράει αντιολισθητικά γάντια και γαλότσες αλλά και του 26χρονου Αυστριακού Φραντς που επισκέφθηκε πρόσφατα τη χώρα μας και χρησιμοποίησε τον Ηλεκτρικό για να φθάσει στον Πειραιά, όπου προς μεγάλη του απογοήτευση διαπίστωσε πως όλα του τα ρούχα ήταν βρεγμένα. «Ήταν σαν να τα έχω βουτήξει στη λίμνη του Χάλστατ», αναφέρει χαρακτηριστικά μέσω Skype στο «Κουλούρι».',
           '2014-07-18')");


  echo "OK <br>";
?>

    <br>...done.
  </body>
</html>
